Autodesk.Revit.DB.ArcLengthDimensionGeometryOptions.Create(Autodesk.Revit.DB.View,Autodesk.Revit.DB.DimensionType,Autodesk.Revit.DB.Arc,Autodesk.Revit.DB.Arc,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.Line)
Creates an instance of Autodesk.Revit.DB.ArcLengthDimensionGeometryOptions with the specified parameters.
view:
The view whose properties will be used to compute the dimension geometry.
dimensionType:
The Autodesk.Revit.DB.DimensionType of the dimension.
extensionArc:
The extension arc of the dimension.
arcRef:
The arc to which the dimension is to be bound. This arc must be parallel to the extension arc.
firstLine:
The first reference line to which the dimension is to be bound. This reference must intersect the arcRef reference.
secondLine:
The second reference line to which the dimension is to be bound. This reference must intersect the arcRef reference.
Returns:
Returns an instance of Autodesk.Revit.DB.ArcLengthDimensionGeometryOptions with the specified parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ArcLengthDimensionGeometryOptions
A class that encapsulates the options needed to create the Arc Length Dimension geometry.